Ruby_On_Rails_CRUD_Blog/app/views/comments/_comments.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 7]]
---

<% @post.comments.each do |comment| %>