Ruby_On_Rails_CRUD_Blog/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "fivefive"], ["body", "fivefive"], ["updated_at", "2018-04-11 01:25:38.802745"], ["id", 5]]
---
	def update
		@post = Post.find(params[:id])
		if(@post.update(post_params))

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "three"], ["body", "three"], ["created_at", "2018-04-10 22:15:38.875953"], ["updated_at", "2018-04-10 22:15:38.875953"]]
---
	def create
		#render plain: params[:post].inspect
		@post = Post.new(post_params)
		if(@post.save)